import React from 'react';
import { Col, Container, Row } from 'react-bootstrap';

const BLog = () => {
    return (
        <div className='py-5'>
            <Container>
                <Row className='py-5'>
                    <Col md="4">
                        <h2 className='text-primary'>অথেনটিকেশন এবং অথোরাইজেশন মধ্যে পার্থক্য ?</h2>
                        <p>অথেনটিকেশন হলো আমার পরিচয়। যেমন আমি বাংলাদেশের নাগরিক। এর জন্য আমার  আইডি কার্ড লাগবে। যদি কোনো কারণে আমাকে কোনো বিশেষ কাজের জন্য বলে যে আমাকে প্রমান করতে হবে যে আমি এই দেশের নাগরিক তাহলে আমার পিওর আইডি কার্ড হলো  হলো আমার অথেনটিকেশন;
আর অথোরাইজেশন হলো অনুমোধন যেমন আমার বাবার সম্পত্তি আমাকে বেবহার করার জন্য দেয়াই হলো অথোরাইজেশন </p>
                    </Col>
                    <Col md="4">
                        <h2 className='text-primary'>আপনি কেন ফায়ারবেস ব্যবহার করছেন? প্রমাণীকরণ বাস্তবায়নের জন্য আপনার কাছে অন্য কোন বিকল্প আছে?</h2>
                        <p>আমি আমার ওয়েবসাইট সবাইকে বেবহার করতে দিবোনা। একমাত্র তাদের এই দিবো যারা তাদের পরিচয় দিবে। আর এই জন্যই আমি ফাইয়ারবেইজ বেবহার করবো। 
আর এই অথেনটিনিকেশন সম্পন্ন করার জন্য অনেক থার্ট প্রার্থী রয়েছে যেমন অক্টা, অথ০ ,মাইক্রোসফট ইত্যাদি  
 </p>
                    </Col>
                    <Col md="4">
                        <h2  className='text-primary'>ফায়ারবেস প্রমাণীকরণ ব্যতীত অন্য কোন পরিষেবা প্রদান করে ?</h2>
                        <p>ফাইয়ারবেইজ অথেনটিনিকেশন ব্যথিত অনেক কিছু প্রধান করে যেমন ,রিয়েলটাইম ডাটাবেইজ ,এপিআই ,গুগল এডমোব ,গুগল এডস ইত্যাদি </p>
                    </Col>
                </Row>
            </Container>
        </div>
    );
    
};


export default BLog;